import XCTest
@testable import SwiftTokenizer

final class SwiftTokenizerTests: XCTestCase {
    func test() {
        let sourceString =
            """
        漢皇重色思傾國，御宇多年求不得。楊家有女初長成，養在深閨人未識。\
        天生麗質難自棄，一朝選在君王側。回眸一笑百媚生，六宮粉黛無顏色。\
        春寒賜浴華清池，溫泉水滑洗凝脂。侍兒扶起嬌無力，始是新承恩澤時。\
        雲鬢花顏金步搖，芙蓉帳暖度春宵。春宵苦短日高起，從此君王不早朝。\
        承歡侍宴無閒暇，春從春遊夜專夜。後宮佳麗三千人，三千寵愛在一身。\
        金屋妝成嬌侍夜，玉樓宴罷醉和春。姊妹弟兄皆列土，可憐光彩生門戶。\
        遂令天下父母心，不重生男重生女。驪宮高處入青雲，仙樂風飄處處聞。\
        緩歌慢舞凝絲竹，盡日君王看不足。漁陽鼙鼓動地來，驚破霓裳羽衣曲。\
        九重城闕煙塵生，千乘萬騎西南行。翠華搖搖行復止，西出都門百餘里。\
        六軍不發無奈何，宛轉蛾眉馬前死。花鈿委地無人收，翠翹金雀玉搔頭。\
        君王掩面救不得，回看血淚相和流。黃埃散漫風蕭索，雲棧縈紆登劍閣。\
        峨嵋山下少人行，旌旗無光日色薄。蜀江水碧蜀山青，聖主朝朝暮暮情。\
        行宮見月傷心色，夜雨聞鈴腸斷聲。天旋地轉回龍馭，到此躊躇不能去。\
        馬嵬坡下泥土中，不見玉顏空死處。君臣相顧盡沾衣，東望都門信馬歸。\
        歸來池苑皆依舊，太液芙蓉未央柳。芙蓉如面柳如眉，對此如何不淚垂。\
        春風桃李花開日，秋雨梧桐葉落時。西宮南內多秋草，落葉滿階紅不掃。(花開日 一作：花開夜；南內 一作：南苑)\
        梨園弟子白髮新，椒房阿監青娥老。夕殿螢飛思悄然，孤燈挑盡未成眠。\
        遲遲鐘鼓初長夜，耿耿星河欲曙天。鴛鴦瓦冷霜華重，翡翠衾寒誰與共。\
        悠悠生死別經年，魂魄不曾來入夢。臨邛道士鴻都客，能以精誠致魂魄。\
        爲感君王輾轉思，遂教方士殷勤覓。排空馭氣奔如電，昇天入地求之遍。\
        上窮碧落下黃泉，兩處茫茫皆不見。忽聞海上有仙山，山在虛無縹渺間。\
        樓閣玲瓏五雲起，其中綽約多仙子。中有一人字太真，雪膚花貌參差是。\
        金闕西廂叩玉扃，轉教小玉報雙成。聞道漢家天子使，九華帳裏夢魂驚。\
        攬衣推枕起徘徊，珠箔銀屏迤邐開。雲鬢半偏新睡覺，花冠不整下堂來。\
        風吹仙袂飄飄舉，猶似霓裳羽衣舞。玉容寂寞淚闌干，梨花一枝春帶雨。(闌 通：欄；飄飄 一作：飄颻)\
        含情凝睇謝君王，一別音容兩渺茫。昭陽殿裏恩愛絕，蓬萊宮中日月長。\
        回頭下望人寰處，不見長安見塵霧。惟將舊物表深情，鈿合金釵寄將去。\
        釵留一股合一扇，釵擘黃金合分鈿。但教心似金鈿堅，天上人間會相見。\
        臨別殷勤重寄詞，詞中有誓兩心知。七月七日長生殿，夜半無人私語時。\
        在天願作比翼鳥，在地願爲連理枝。天長地久有時盡，此恨綿綿無絕期。
        """
        let sut = SwiftTokenizer(sourceString: sourceString)
        print(sut.wordTokens())
//        XCTAssertEqual(sut.wordTokens(), ["漢皇", "重", "色", "思", "傾", "國", "，", "御", "宇多", "年", "求不得", "。", "楊家", "有", "女", "初", "長成", "，", "養", "在", "深", "閨", "人", "未", "識", "。", "天生麗質", "難", "自棄", "，", "一朝", "選", "在", "君王", "側", "。", "回眸", "一", "笑", "百", "媚", "生", "，", "六", "宮", "粉黛", "無", "顏色", "。", "春", "寒", "賜", "浴", "華清池", "，", "溫泉", "水", "滑", "洗", "凝脂", "。", "侍", "兒", "扶起", "嬌", "無力", "，", "始", "是", "新", "承", "恩澤", "時", "。", "雲", "鬢", "花", "顏", "金", "步", "搖", "，", "芙蓉", "帳", "暖", "度", "春宵", "。", "春宵", "苦", "短", "日", "高起", "，", "從此", "君王", "不", "早", "朝", "。", "承歡", "侍", "宴", "無", "閒暇", "，", "春", "從", "春", "遊", "夜", "專", "夜", "。", "後宮", "佳麗", "三千", "人", "，", "三千", "寵愛", "在", "一", "身", "。", "金", "屋", "妝", "成", "嬌", "侍", "夜", "，", "玉", "樓", "宴", "罷", "醉", "和", "春", "。", "姊妹", "弟兄", "皆", "列", "土", "，", "可憐", "光彩", "生", "門戶", "。", "遂", "令", "天下", "父母心", "，", "不", "重生", "男", "重生", "女", "。", "驪宮", "高處", "入", "青雲", "，", "仙樂", "風", "飄", "處處", "聞", "。", "緩", "歌", "慢", "舞", "凝", "絲竹", "，", "盡", "日", "君王", "看", "不足", "。", "漁", "陽", "鼙", "鼓動", "地", "來", "，", "驚", "破", "霓裳", "羽衣", "曲", "。", "九", "重", "城", "闕", "煙塵", "生", "，", "千", "乘", "萬", "騎", "西南", "行", "。", "翠", "華", "搖搖", "行", "復", "止", "，", "西", "出", "都", "門", "百餘", "里", "。", "六", "軍", "不", "發", "無奈何", "，", "宛轉", "蛾眉", "馬", "前", "死", "。", "花", "鈿", "委", "地", "無", "人", "收", "，", "翠", "翹", "金", "雀", "玉", "搔頭", "。", "君王", "掩", "面", "救", "不", "得", "，", "回看", "血淚", "相", "和", "流", "。", "黃", "埃", "散漫", "風", "蕭索", "，", "雲", "棧", "縈", "紆", "登", "劍", "閣", "。", "峨嵋", "山", "下", "少", "人", "行", "，", "旌旗", "無", "光", "日色", "薄", "。", "蜀", "江水", "碧", "蜀", "山青", "，", "聖主", "朝", "朝", "暮", "暮", "情", "。", "行宮", "見", "月", "傷心", "色", "，", "夜", "雨", "聞", "鈴", "腸", "斷", "聲", "。", "天旋地轉", "回", "龍", "馭", "，", "到", "此", "躊躇", "不能", "去", "。", "馬嵬坡", "下", "泥土", "中", "，", "不", "見", "玉", "顏", "空", "死", "處", "。", "君臣", "相顧", "盡", "沾", "衣", "，", "東", "望", "都", "門", "信", "馬", "歸", "。", "歸來", "池", "苑", "皆", "依舊", "，", "太", "液", "芙蓉", "未", "央", "柳", "。", "芙蓉", "如", "面", "柳如", "眉", "，", "對", "此", "如何", "不", "淚", "垂", "。", "春風", "桃李", "花", "開", "日", "，", "秋雨", "梧桐", "葉", "落", "時", "。", "西", "宮", "南", "內", "多", "秋", "草", "，", "落葉", "滿", "階", "紅", "不", "掃", "。(", "花", "開", "日", " ", "一", "作", "：", "花", "開", "夜", "；", "南", "內", " ", "一", "作", "：", "南苑", ")", "梨園", "弟子", "白髮", "新", "，", "椒", "房", "阿", "監", "青", "娥", "老", "。", "夕", "殿", "螢", "飛", "思", "悄然", "，", "孤", "燈", "挑", "盡", "未", "成眠", "。", "遲遲", "鐘鼓", "初", "長夜", "，", "耿", "耿", "星河", "欲", "曙", "天", "。", "鴛鴦", "瓦", "冷霜", "華", "重", "，", "翡翠", "衾寒", "誰", "與", "共", "。", "悠悠", "生死", "別", "經年", "，", "魂魄", "不", "曾", "來", "入夢", "。", "臨", "邛", "道士", "鴻", "都", "客", "，", "能", "以", "精誠", "致", "魂魄", "。", "爲", "感", "君王", "輾轉", "思", "，", "遂", "教", "方士", "殷勤", "覓", "。", "排", "空", "馭", "氣", "奔", "如", "電", "，", "昇", "天", "入", "地", "求", "之", "遍", "。", "上", "窮", "碧落", "下", "黃泉", "，", "兩", "處", "茫茫", "皆", "不", "見", "。", "忽", "聞", "海", "上", "有", "仙", "山", "，", "山", "在", "虛無", "縹渺", "間", "。", "樓閣", "玲瓏", "五", "雲", "起", "，", "其中", "綽約", "多", "仙子", "。", "中", "有", "一", "人", "字", "太", "真", "，", "雪", "膚", "花", "貌", "參差", "是", "。", "金", "闕", "西廂", "叩", "玉", "扃", "，", "轉", "教", "小玉", "報", "雙", "成", "。", "聞道", "漢家", "天子", "使", "，", "九", "華", "帳", "裏", "夢", "魂", "驚", "。", "攬", "衣", "推", "枕", "起", "徘徊", "，", "珠", "箔", "銀", "屏", "迤邐", "開", "。", "雲", "鬢", "半", "偏", "新", "睡覺", "，", "花冠", "不", "整", "下", "堂", "來", "。", "風", "吹", "仙", "袂", "飄飄", "舉", "，", "猶", "似", "霓裳", "羽衣", "舞", "。", "玉", "容", "寂寞", "淚", "闌", "干", "，", "梨", "花", "一", "枝", "春", "帶", "雨", "。", "(", "闌", " ", "通", "：", "欄", "；", "飄飄", " ", "一", "作", "：", "飄", "颻", ")", "含", "情", "凝", "睇", "謝", "君王", "，", "一", "別", "音容", "兩", "渺茫", "。", "昭", "陽", "殿", "裏", "恩愛", "絕", "，", "蓬萊", "宮", "中", "日月", "長", "。", "回頭", "下", "望", "人", "寰", "處", "，", "不", "見", "長安", "見", "塵霧", "。", "惟", "將", "舊物", "表", "深情", "，", "鈿", "合金", "釵", "寄", "將", "去", "。", "釵", "留", "一", "股", "合一", "扇", "，", "釵", "擘", "黃金", "合分", "鈿", "。", "但", "教", "心", "似", "金", "鈿", "堅", "，", "天", "上", "人間", "會", "相見", "。", "臨別", "殷勤", "重", "寄", "詞", "，", "詞", "中", "有", "誓", "兩", "心", "知", "。", "七月", "七日", "長生", "殿", "，", "夜半", "無", "人", "私語", "時", "。", "在", "天", "願", "作", "比", "翼", "鳥", "，", "在", "地", "願", "爲", "連理", "枝", "。", "天長地久", "有時", "盡", "，", "此", "恨", "綿綿", "無", "絕", "期", "。"])
    }
}



































